
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7571386781)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_compute_network.shared-test


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_network.shared-test will be created
  + resource "google_compute_network" "shared-test" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "shared-test"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "gig-japan-398904"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":2,"Program":"tfcmt","SHA1":"4b6845730294b8d90e27ad2d8ce689d922580bd4","Vars":{},"WorkflowName":"iaac_plan"} -->